Repository: i-HMS/ihms-sysconf
Catalog: po/*.po
Languages: fr

source: Please do not capitalize the first letter of the sysconf frontend.
fr: Veuillez ne pas mettre la première lettre de l'interface sysconf en majuscule.

source: Falling back to frontend %s
fr: Utilisation de l'interface %s en remplacement

source: Unable to initialize frontend %s
fr: Impossible d'initialiser l'interface : %s

source: Unable to start a frontend %s
fr: Impossible de démarrer l'interface : %s

source: No configuration file found.
fr: Aucun fichier de configuration n'a été trouvé.

source: sysconf: Config database not specified in config file.
fr: Le fichier de configuration n'indique pas l'emplacement de la base de données des réglages.

source: sysconf: Templates database not specified in config file.
fr: Le fichier de configuration n'indique pas l'emplacement de la base de données des messages (« templates »).

source: sysconf: Problem setting up the database defined by configuration stanza %d in %s : %s.
fr: Problème pendant la configuration de la base de données définie au paragraphe %d dans %s : %s.

source: Specify sysconf frontend to use.
fr: Spécifie l'interface sysconf à utiliser.

source: Specify minimum priority question to show.
fr: Spécifie la priorité minimale des questions à afficher.

source: Display usage help.
fr: Affiche l'aide.

source: Ignoring invalid priority %s
fr: La priorité « %s » non valable sera ignorée

source: Valid priorities are "%s"
fr: Les priorités valables sont : %s

source: Attempt to access unknown property '%s' at %s line %s.
fr: Tentative d'accès à une propriété inconnue '%s' dans le fichier %s à la ligne %s.

source: Error while parsing configuration file.
fr: Erreur lors de l'analyse du fichier de configuration.

source: Configuration database %s was not initialized
fr: La base de données des réglages %s n'a pas été initialisée

source: Templates database %s was not initialized
fr: La base de données des messages (« templates ») %s n'a pas été initialisée

source: Driver type not specified
fr: Type du pilote non spécifié

source: Driver %s not found: %s
fr: Le pilote %s n'a pas été trouvé: %s

source: Wrong configuration value '%s' for %s field: %s
fr: Mauvaise valeur de configuration '%s' pour le champs %s : %s

source: (unknown)
fr: (inconnu)

source: no name specified
fr: pas de nom spécifié

source: Sysconf was not configured to display this error message, so it mailed it to you
fr: Sysconf n'a pas été configuré pour afficher ce message d'erreur, il vous l'a donc envoyée par courrier électronique.

source: unknown system
fr: système inconnu

source: Sysconf, running at %s
fr: Sysconf, s'exécutant sur %s

source: yes
fr: oui

source: no
fr: non

source: none of the above
fr: aucun des éléments mentionnés

source: Enter the items you want to select, separated by spaces.
fr: Entrez les éléments que vous voulez choisir, séparés par des espaces.

source: Configuring %s
fr: Configuration de %s

source: Unable to load iHMS_Sysconf_Element_%s. Failed because %s
fr: Impossible de charger iHMS_Sysconf_Element_%s. Cause de l'échec : %s

source: TERM is not set, so dialog frontend is not usable.
fr: La variable TERM n'a pas de valeur, l'interface dialog est donc inutilisable.

source: Dialog frontend is incompatible with emacs shell buffers.
fr: L'interface dialog est incompatible avec les tampons shell d'Emacs

source: Dialog frontend will not work on a dumb terminal, an emacs shell buffer or without a controlling terminal.
fr: L'interface dialog ne fonctionnera pas avec un terminal rustique (« dumb »), un tampon shell d'Emacs ou sans terminal de contrôle.

source: No usable dialog-like program is installed, so the dialog based frontend cannot be used
fr: Aucun programme de type dialog n'est installé, l'interface basée sur dialog ne peut donc pas être utilisée.

source: Dialog frontend requires a screen at least 13 lines tall and 31 columns wide.
fr: L'interface dialog a besoin d'un écran d'au moins 13 lignes sur 31 colonnes.

source: Module configuration
fr: Outil de configuration des modules

source: sysconf: %s output the above errors, giving up!
fr: sysconf: %s a produit l'erreur ci-dessus. Veullez la corriger.

source: More
fr: Suite

source: warning: possible database corruption. Will attempt to repair by adding back missing question %s
fr: Attention : corruption possible de la base de données. Tentative de réparation en rajoutant la question manquante %s.

source: Template %s in %s has a duplicate field "%s" with new value "%s". Probably two templates are not properly separated by a one newline.
fr: Dans le message (« template ») %s de %s, le champ « %s » est dupliqué avec « %s » comme nouvelle valeur. Il manque probablement la ligne vide de séparation entre deux messages.

source: Template parse error near `%s', in stanza %d of %s
fr: Champ de message « %s » inconnu, dans la partie %d de %s

source: Template %d in %s does not contain a 'Template:' line
fr: Le message n° %d de %s ne contient pas de ligne « Template: »

source: iHMS mode.
fr: Mode iHMS

source: Specify external module scanner to use.
fr: Spécifie un scanner de module externe à utiliser

source: must specify some modules to preconfigure
fr: doit spécifier des modules à pré-configurer

source: sysconf: external scanner `%s' is not executable or doesn't exists.
fr: sysconf: le scanner de module externe `%s' n'est pas un exécutable ou n'existe pas.

source: delaying module configuration, since a module scanner is not installed nor provided on the command line.
fr: Configuration du module retardée. Le scanner de module n'est pas installé ou son chemin n'a pas été fourni sur la ligne de commande.

source: %s failed: %s
fr: %s a échoué: %s

source: Extracting templates from modules: %d%%
fr: Extraction des templates à partir des modules: %d%%

source: Preconfiguring modules ...
fr: Preconfiguration des modules ...

source: %s template parse error: %s
fr: Erreur pendant l'analyse du template %s: %s

source: preconfiguring %s (%s)
fr: preconfiguration de %s (%s)

source: sysconf: can't chmod: %s
fr: sysconf: Impossible de changer les permissions: %s

source: %s failed to preconfigure, with exit status %d
fr: %s à échoué pendant la pré-configuration avec le code de sortie %d

source: Cannot read status file: %s
fr: Ne peut pas lire le fichier status: %s

source: Reconfigure all modules.
fr: Reconfiguration de tous les modules.

source: Show only not yet seen questions.
fr: Ne montrer que les questions qui n'ont pas encore été vue

source: Use default priority instead of low.
fr: Utiliser la priorité par défaut au lieu de la priorité basse.

source: Force reconfiguration of broken modules.
fr: Force la reconfiguration des modules cassés.

source: Do not reload templates. (Use with caution.)
fr: Ne pas recharger les templates. (Utiliser avec prudence)

source: %s must be run as root.
fr: %s doit être exécuter sous le compte de l'utilisateur root.

source: Please specify a module to reconfigure
fr: Veuillez spécifier un module à reconfigurer

source: %s is not installed.
fr: %s n'est pas installé.

source: %s is broken or not fully installed.
fr: %s est cassé ou n'est pas installé

source: Loading answer for '%s'
fr: Chargement de la réponse pour '%s'

source: Cannot find a question for %s
fr: Ne peut pas trouver une question pour %s

source: Setting %s answer flag
fr: Paramétrage du drapeau de réponse %s

source: parse error on line %d: '%s'
fr: Erreur d'analyse à la ligne %d: '%s'

source: Unknown type %s, skipping line %s
fr: Type %s inconnue, ligne %s ignorée

source: Can't open %s: %s
fr: Impossible d'ouvrir %s: %s

source: Trying to set '%s' flag to '%s'
fr: Tentative de paramétrage du drapeau %s à '%s'

source: Trying to set '%s' [%s] to '%s'
fr: Tentative de paramétrage de '%s' [%s] à '%s'

source: %s: unknown database
fr: %s: Base de données inconnue
